# Introduction to Python and git/github
Can you open this notebook?  <br>
You should install the following applications.  <br> 
- git/github
- sourcetree (GUI for git/github)
- anaconda (for opening jupyter notebook)  or Docker.

# Basics of Python

## Arithmatic operation

In [1]:
a = 1
print(a)

1

In [2]:
a

1

In [3]:
a = 1 + 2 
b = 1 - 4 
c = 1 * 3
d = 1 / 4
print(a,b,c,d)

3 -3 3 0.25

### Problem.

In [4]:
"""Git answers below. 
1 + 2*3 - 4/10 + 1 
"""
a = 1 
print(a)

1

## Variables

In [5]:
a = 1 + 3 
b = 4 + 7 
c = a + b 
d = a - c 
print(d)

-11

In [6]:
a = 1 
print(a)
b = 3 
a = a +  b
print(a)

1
4

## For

In [7]:
for i in range(3, 10):
    print(i)

3
4
5
6
7
8
9

In [8]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

### Problem
Calculate and output, i*5 from i = 1 to 20

In [35]:
for i in range(1, 21):
    i = i*5
    print(i)

5
10
15
20
25
30
35
40
45
50
55
60
65
70
75
80
85
90
95
100

## String

In [9]:
s = "funny funny "
print(s + s )

funny funny funny funny

In [10]:
print(s[0], s[1], s[2], s[3], s[4])

f u n n y

## List

In [11]:
l = [1, 2, 3]
l2 = [ 1, "a", "b"]

In [12]:
l

[1, 2, 3]

In [13]:
l2

[1, 'a', 'b']

In [14]:
# can use for. 
for ll in l:
    print(ll)

1
2
3

In [15]:
# add element 
l.append(4)
l.append("str")
l

[1, 2, 3, 4, 'str']

In [39]:
l = []
for i in range(3,101):
    l.append(i)
l

[3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99,
 100]

### Problem 
write fibonacci from 1 to 100

In [40]:
l=[]
for i in range(10):
    for j in range(10):

In [16]:
a = 1 
b = 1 
res = [a,b ]
for i in range(98):
    c = a + b 
    a = b
    b = c 
    res.append(c)

# Pandas

In [42]:
import numpy as np 
import pandas as pd

In [43]:
df = pd.DataFrame({
    "a":[0, 1, 0, 1, 1, 1, 1, 0, 1, 1, 0],
    "b":[1, 0, 2, 5, 4, 5, 2, 5, 1, 3, 2],
    "c":["test1",  "test2", "test3", "test1", np.nan, "test2", "test2", 2, 2, "test2", 2]
    })
display(df)

    a  b      c
0   0  1  test1
1   1  0  test2
2   0  2  test3
3   1  5  test1
4   1  4    NaN
5   1  5  test2
6   1  2  test2
7   0  5      2
8   1  1      2
9   1  3  test2
10  0  2      2

In [44]:
df["a"].value_counts()

1    7
0    4
Name: a, dtype: int64

In [45]:
df["b"].value_counts()

2    3
5    3
1    2
0    1
3    1
4    1
Name: b, dtype: int64

In [46]:
df["b"].unique()

array([1, 0, 2, 5, 4, 3])

In [49]:
df["c"].value_counts(dropna=False)

test2    4
2        3
test1    2
NaN      1
test3    1
Name: c, dtype: int64

In [51]:
df["c"].unique()

array(['test1', 'test2', 'test3', nan, 2], dtype=object)

In [20]:
df["a"].unique()

array([0, 1])

In [52]:
df.columns

Index(['a', 'b', 'c'], dtype='object')

In [61]:
for c in df.columns:
    #print("+"*50)
    print(f"==============Column [{c}]===========")
    print(df[c].value_counts())

==============Column [a]===========
1    7
0    4
Name: a, dtype: int64
==============Column [b]===========
2    3
5    3
1    2
0    1
3    1
4    1
Name: b, dtype: int64
==============Column [c]===========
test2    4
2        3
test1    2
test3    1
Name: c, dtype: int64

### Problem
Explore "b" and "c" columns

## simple cross tab

In [21]:
table = pd.crosstab(df["a"], df["c"])
display(table)
print(table.to_csv())

c  2  test1  test2  test3
a
0  2      1      0      1
1  1      1      4      0

a,2,test1,test2,test3
0,2,1,0,1
1,1,1,4,0

In [22]:
df = pd.DataFrame({
    "x": np.random.randint(low=0,high=4,size=1000),
    "y": np.random.randint(low=10, high=14, size=1000),
    "z": np.random.randint(low=1000, high=1005, size=1000)
    })

In [23]:
df

     x   y     z
0    0  12  1003
1    3  10  1000
2    2  12  1001
3    2  11  1000
4    3  12  1000
..  ..  ..   ...
995  2  12  1004
996  1  11  1004
997  1  11  1004
998  3  11  1001
999  3  12  1002

[1000 rows x 3 columns]

In [24]:
table = pd.crosstab(df["x"], df["y"])
display(table)

y  10  11  12  13
x
0  72  59  77  88
1  64  60  60  57
2  59  57  44  73
3  51  56  62  61

In [25]:
table_per = pd.crosstab(df["x"], df["y"], normalize=0)
display(table_per)
table_per.sum(axis=1)

y        10        11        12        13
x
0  0.243243  0.199324  0.260135  0.297297
1  0.265560  0.248963  0.248963  0.236515
2  0.253219  0.244635  0.188841  0.313305
3  0.221739  0.243478  0.269565  0.265217

x
0    1.0
1    1.0
2    1.0
3    1.0
dtype: float64

### Tips 
get multiple tables to one sheet.

In [26]:
df.columns

Index(['x', 'y', 'z'], dtype='object')

In [27]:
cols = ['x', 'y', 'z']

In [28]:
df.index

RangeIndex(start=0, stop=1000, step=1)

In [29]:
s = ""

table = pd.crosstab(df["x"], df["y"])
display(table)
s += "x v.s. y\n"
s += table.to_csv()
s += "\n"

table = pd.crosstab(df["y"], df["z"])
display(table)
s += "y v.s. z\n"
s += table.to_csv()
s += "\n"

table = pd.crosstab(df["x"], df["z"])
display(table)
s += "x v.s. z\n"
s += table.to_csv()
s += "\n"

y  10  11  12  13
x
0  72  59  77  88
1  64  60  60  57
2  59  57  44  73
3  51  56  62  61

z   1000  1001  1002  1003  1004
y
10    55    40    52    44    55
11    46    54    46    49    37
12    53    53    40    53    44
13    53    57    57    48    64

z  1000  1001  1002  1003  1004
x
0    52    62    67    59    56
1    56    50    44    40    51
2    49    51    36    47    50
3    50    41    48    48    43

In [30]:
df["z"]

0      1003
1      1000
2      1001
3      1000
4      1000
       ...
995    1004
996    1004
997    1004
998    1001
999    1002
Name: z, Length: 1000, dtype: int64

In [31]:
print(s)

x v.s. y
x,10,11,12,13
0,72,59,77,88
1,64,60,60,57
2,59,57,44,73
3,51,56,62,61

y v.s. z
y,1000,1001,1002,1003,1004
10,55,40,52,44,55
11,46,54,46,49,37
12,53,53,40,53,44
13,53,57,57,48,64

x v.s. z
x,1000,1001,1002,1003,1004
0,52,62,67,59,56
1,56,50,44,40,51
2,49,51,36,47,50
3,50,41,48,48,43